<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Firebase Credentials
    |--------------------------------------------------------------------------
    |
    | المسار إلى ملف JSON الخاص ببيانات اعتماد Firebase.
    | يمكنك ضبط المسار من خلال ملف البيئة .env
    |
    */

    'credentials' => [
        'file' => env('FIREBASE_CREDENTIALS'), // ضع هنا مسار ملف بيانات اعتماد Firebase
    ],

    /*
    |--------------------------------------------------------------------------
    | Firebase Realtime Database
    |--------------------------------------------------------------------------
    |
    | إعدادات قاعدة بيانات Firebase في حال كنت تستخدم قاعدة بيانات Realtime
    |
    */

    'database' => [
        'url' => env('FIREBASE_DATABASE_URL'), // يمكنك تحديد عنوان قاعدة البيانات هنا
    ],

    /*
    |--------------------------------------------------------------------------
    | Dynamic Links
    |--------------------------------------------------------------------------
    |
    | في حال كنت تستخدم روابط ديناميكية من Firebase
    |
    */

    'dynamic_links' => [
        'default_domain' => env('FIREBASE_DYNAMIC_LINKS_DEFAULT_DOMAIN'),
    ],

    /*
    |--------------------------------------------------------------------------
    | Storage
    |--------------------------------------------------------------------------
    |
    | إعدادات التخزين من Firebase Storage إذا كنت تستخدمها
    |
    */

    'storage' => [
        'default_bucket' => env('FIREBASE_STORAGE_BUCKET'),
    ],

    /*
    |--------------------------------------------------------------------------
    | Caching
    |--------------------------------------------------------------------------
    |
    | الإعدادات الافتراضية لتخزين Firebase في ذاكرة الكاش لتحسين الأداء
    |
    */

    'cache_store' => env('FIREBASE_CACHE_STORE', 'file'),

    /*
    |--------------------------------------------------------------------------
    | Logging
    |--------------------------------------------------------------------------
    |
    | إعدادات تسجيل عمليات Firebase في ملف السجل
    |
    */

    'logging' => [
        'http_log_channel' => env('FIREBASE_HTTP_LOG_CHANNEL', null),
    ],
];
